chat_system_1570357704_actor_description=Ameliy Midas. Titans' museum curator. Titans' expert.
chat_system_1570357704_switch_0_header_1=^?^Have you driven orcs away from the museum? Is it good news you bring? Or is there something else that I can help you with?<br>For only 1000 coins I can let you in to the holiest of holies - the Titans' underground!<br>And for one coin I can tell you something of the history of Endoria.
chat_system_1570357704_switch_0_header_2=^?^I welcome you once again to the Titans' museum.<br>What can I do for you this time?<br>For only 1000 coins I can let you in to the holiest of holies - the Titans' underground!<br>And for one coin I can tell you something of the history of Endoria.
chat_system_1570357704_snap_0_question=^?^You're standing at the entrance to the underground, which is hidden under this powerful Titan's shoe! I'm Ameliy Midas, minister of the religion of Titanology.<br>Only for a scant 1000 coins I can let you in to the holiest of holies - the Titans' underground! Or, for one coin I can tell you something of the history of Endoria.
chat_system_1570357704_snap_0_answer_0=^?^Unfortunately, I don't have any good news for you yet. The orcs are still in there.
chat_system_1570357704_snap_0_answer_1=^?^There're no more orcs now.
chat_system_1570357704_snap_0_answer_2=^?^Look, don't you offer any discounts for those who protect your museum from orcs?
chat_system_1570357704_snap_0_answer_3=^?^Yes, of course I'd like to visit your museum. Here are your 1000 gold coins.
chat_system_1570357704_snap_0_answer_4=^?^I'd like to hear something about Endorian history.
chat_system_1570357704_snap_0_answer_5=^?^I'm not in the mood now, but maybe next time.
chat_system_1570357704_snap_3_question=^?^Well, since you've helped me, I'll open the entrance for 500 coins.
chat_system_1570357704_snap_3_answer_0=^?^Ok, open it.
chat_system_1570357704_snap_3_answer_1=^?^No, but not right now.
chat_system_1570357704_snap_4_question=^?^Endoria was the third of the created worlds, which appeared by the will of those gods who had learned to create worlds. The seeds of life germinated here, and soon there were created a variety of fanciful forms, one of which turned out to be much stronger and cleverer than others. The fierce pangolins, which lived in poisonous swamps, calling themselves Scraggs, crawled out from their bogs, gobbling each other and the other creatures. Wishing goodness and prosperity for Endoria, the Gods created Titans - gigantic creatures possessing great intellect. Besides intellect, the gods gave them the Creator's spark, a great gift which the gods learned to regret soon enough.
chat_system_1570357704_snap_4_answer_0=^?^So Scraggs were the first, and the Titans second. I see.
chat_system_1570357704_snap_4_header_0=^?^I tell one story for one coin.<br>Anything else?
chat_system_1570357704_snap_5_question=^?^Soon after their creation, the Titans realized their semi-divine substance. They started a war with the pangolins, which inhabited all Endoria at that time. They inflicted the Great Winter in order to eliminate the cold-blooded scraggs, as well as the other creatures, then populated the world anew. And first they decided to create living creatures possessing intellect, just as they themselves were created by the gods. And so the orcs appeared, the first-born nation to be created not by the gods, but by Titans. Thus orcs worship Titans even to this day.
chat_system_1570357704_snap_5_answer_0=^?^So in reality, the first-born nation is the orcs? And they are now the most ancient race still living in Endoria?
chat_system_1570357704_snap_5_header_0=^?^I tell one story for one coin.<br>Anything else?
chat_system_1570357704_snap_6_question=^?^All this which the Titans were doing was not planned by the gods, and they did not approve of the Titans' destruction and rebuilding of all they had created. But the gods could not tolerate their creation of the Land of Death.<br>The gods became very angry, the land opened wide under the Titans' feet. All were eliminated. The Gods started to populate Endoria once again, but this time they were wiser, and no one was given the Creator's spark. And so the gods created the humans, elves and dwarves.<br>The new races began to re-divide the lands, eliminating the living creatures which were created by the Titans. But they did not manage to eliminate all of them. The orcs, for instance, have asserted their right to live, though they were banished to barren Murock...
chat_system_1570357704_snap_6_answer_0=^?^So, this museum is the only thing left of the Titans? It's a pity; I'd like to speak to them.
chat_system_1570357704_snap_6_header_0=^?^I tell one story for one coin.<br>Anything else?
chat_system_1570357704_snap_1_question=^?^You are aware that all the deceased go into the Land of Death, but do you also know that before the Titans, all the deceased used to simply vanish forever? It was only thanks to Titans that life after death became possible - and that is why they were eliminated by the gods.<br>The Titans wanted to give eternal life to their creatures, but the laws of the gods were unbreakable - a dying creature simply disappeared into the Nothing. Then the Titans created the world where the laws of the gods did not apply. Having gotten there, the deceased could exist for a long time against all rules or mortality. This is how there appeared the Land of Death, and its Death Magic, Necromancy. The Titans themselves called it Second Life Magic - and even the gods have no power to control it.
chat_system_1570357704_snap_1_answer_0=^?^Oh, the gods of Endoria! That's really interesting!
chat_system_1570357704_snap_1_header_0=^?^I tell one story for one coin.<br>Anything else?
chat_system_1570357704_snap_2_question=^?^The Titans soon realized what opportunities they had with the Creator's spark. They were so powerful that they created not only their own magic, which did not depend on divine magic laws, but also made Endoria an open world. This means the creation of passages into the other worlds, and when it was done, guests began to come to Endoria. Many wonderful creatures came there. For example, the dragons came from Ultrax, a very cruel but unimaginably beautiful world, where the dying sun scorches the stones. Here the climate is better for them and they can raise healthy offspring.
chat_system_1570357704_snap_2_answer_0=^?^So dragons are creatures from other worlds? Incredible!
chat_system_1570357704_snap_2_header_0=^?^I tell one story for one coin.<br>Anything else?
